--За базата от данни PC
USE PC;

--Напишете заявка, която извежда модел, честота и размер на диска за
--всички персонални компютри с цена под 1200 долара. Задайте
--псевдоними за атрибутите честота и размер на диска, съответно MHz и
--GBSELECT model, speed AS MHZ, hd AS GBFROM PCWHERE PRICE < 1200;--Напишете заявка, която извежда производителите на принтери без
--повторенияSELECT DISTINCT MAKER --DISTINCT = РАЗЛИЧНИFROM PRODUCTWHERE TYPE = 'PRINTER';--Напишете заявка, която извежда модел, размер на паметта, размер на
--екран за лаптопите, чиято цена е над 1000 долара

SELECT MODEL, HD, SCREEN
FROM LAPTOP
WHERE PRICE > 1000;

--Напишете заявка, която извежда всички цветни принтери

SELECT *
FROM PRINTER
WHERE COLOR = 'Y';

--Напишете заявка, която извежда модел, честота и размер на диска за
--тези персонални компютри със CD 12x или 16x и цена под 2000 долара.

SELECT MODEL, SPEED, HD
FROM PC
WHERE (CD = '12X' OR CD = '16X') AND PRICE < 2000;